Repository: AndyB122/XaoS
Catalog: i18n/*.po
Languages: ru

source: XaoS is out of memory.
ru: XaoS не хватает памяти.

source: %s %.2f times (%.1fE) %2.2f frames/sec %c %i %i %i %i
ru: %s %.2f раз (%.1fE) %2.2f кадров/сек %c %i %i %i %i

source: unzoomed
ru: не масштабировано

source: zoomed
ru: масштабировано

source: framerate:%f
ru: частота кадров: %f

source: Enabling: %s.
ru: Включение: %s.

source: Disabling: %s.
ru: Отключение: %s.

source: Fractal name:%s
ru: Имя фрактала:%s

source: Fractal type:%s
ru: Тип фрактала:%s

source: Mandelbrot
ru: Мандельброт

source: Julia
ru: Жюлиа

source: Formula:%s
ru: Формула:%s

source: View:[%1.12f,%1.12f]
ru: Вид:[%1.12f,%1.12f]

source: size:[%1.12f,%1.12f]
ru: размер:[%1.12f,%1.12f]

source: Rotation:%4.2f Screen size:%i:%i
ru: Поворот:%4.2f Размер экрана:%i:%i

source: Iterations:%-4i Palette size:%i
ru: Итерации:%-4i Размер палитры:%i

source: Autopilot:%-4s Plane:%s
ru: Автопилот:%-4s Плоскость:%s

source: On
ru: Вкл

source: Off
ru: Выкл

source: incoloring:%s outcoloring:%s
ru: окрашивание внутри:%s окрашивание снаружи:%s

source: zoomspeed:%f
ru: скорость масштабирования:%f

source: Parameter:none
ru: Параметр:пусто

source: Parameter:[%f,%f]
ru: Параметр:[%f,%f]

source: Please wait while calculating %s
ru: Пожалуйста, подождите пока идёт расчёт %s

source: Letters per second %i
ru: Букв в секунду %i

source: Rotation speed:%2.2f degrees per second
ru: Скорость вращения: %2.2f градусов в секунду

source: Iterations: %i
ru: Итерации: %i

source: Cycling speed: %i
ru: Скорость зацикливания: %i

source: speed:%2.2f
ru: скорость:%2.2f

source: Thank you for using XaoS
ru: Спасибо за использование XaoS

source: Skipping, please wait...
ru: Пропускание, пожалуйста, подождите...

source: Resize
ru: Изменение размера

source: Quit
ru: Выход

source: Exit now
ru: Выйти сейчас

source: Not yet
ru: Ещё нет

source: Help
ru: Справка

source: Disable XaoS's builtin GUI
ru: Отключить встроенный графический интерфейс XaoS

source: Status
ru: Cостояние

source: Ministatus
ru: Мини-статус

source: Driver
ru: Драйвер

source: Welcome to XaoS version %s
ru: Добро пожаловать в XaoS версии %s

source: Can not allocate buffers
ru: Невозможно выделить буферы

source: Can not create palette
ru: Невозможно создать палитру

source: Can not create image
ru: Невозможно создать изображение

source: Can not allocate tables
ru: Невозможно выделить таблицы

source: Can not initialize driver
ru: Невозможно инициализировать драйвер

source: Can not return back to previous driver
ru: Невозможно вернуться к предыдущему драйверу

source: Perturbation:
ru: Возмущение:

source: Julia-seed:
ru: Зерно Жюлиа:

source: Morphing type:
ru: Тип морфинга:

source: Startuptime:
ru: Время запуска:

source: Stoptime:
ru: Время остановки:

source: File to render:
ru: Файл для рендеринга:

source: Basename:
ru: Базовое имя:

source: Width:
ru: Ширина:

source: Height:
ru: Высота:

source: Real width (cm):
ru: Реальная ширина (см):

source: Real height (cm):
ru: Реальная высота (см):

source: Framerate:
ru: Частота кадров:

source: Image type:
ru: Тип изображения:

source: Antialiasing:
ru: Сглаживание:

source: Always recalculate:
ru: Всегда пересчитывать:

source: Calculate MPEG motion vectors:
ru: Рассчитать векторы движения MPEG:

source: Recommended I frame distance:
ru: Рекомендуемое расстояние между кадрами:

source: Center:
ru: Центр:

source: Radius:
ru: Радиус:

source: Angle:
ru: Угол:

source: Mode:
ru: Режим:

source: Start:
ru: Начало:

source: End:
ru: Конец:

source: Color:
ru: Цвет:

source: Rotations per second:
ru: Оборотов в секунду:

source: Letters per second:
ru: Букв в секунду:

source: Iterations:
ru: Итерации:

source: Text:
ru: Текст:

source: Your command:
ru: Ваша команда:

source: Filename:
ru: Имя файла:

source: Formula:
ru: Формула:

source: X center:
ru: Центр X:

source: Y center:
ru: Центр Y:

source: X Radius:
ru: Радиус X:

source: Y Radius:
ru: Радиус Y:

source: Coordinates:
ru: Координаты:

source: continuous rotation
ru: непрерывное вращение

source: Fast rotation
ru: Быстрое вращение

source: filter
ru: фильтр

source: enable
ru: включить

source: Amount:
ru: Количество:

source: Zooming speed:
ru: Скорость масштабирования:

source: Name:
ru: Имя:

source: Bailout:
ru: Спасение:

source: Julia mode:
ru: Режим Жюлиа:

source: Horizontal position:
ru: Позиция по горизонтали:

source: Vertical position:
ru: Позиция по вертикали:

source: Dynamic resolution:
ru: Динамическое разрешение:

source: Time:
ru: Время:

source: Number:
ru: Число:

source: Algorithm number:
ru: Номер алгоритма:

source: Seed:
ru: Зерно:

source: Shift:
ru: Сдвиг:

source: Frames per second:
ru: Кадров в секунду:

source: Initialization:
ru: Инициализация:

source: renderanim: Must specify a valid absolute path for basename
ru: renderanim: Необходимо указать правильный абсолютный путь для базового имени

source: renderanim: Width parameter must be positive integer in the range 0..4096
ru: renderanim: Параметр ширины должен быть положительным целым числом в диапазоне 0..4096

source: renderanim: Height parameter must be positive integer in the range 0..4096
ru: renderanim: Параметр высоты должен быть положительным целым числом в диапазоне 0..4096

source: renderanim: Invalid real width and height dimensions
ru: renderanim: неверные реальные размеры по ширине и высоте

source: renderanim: invalid framerate
ru: renderanim: неверная частота кадров

source: renderanim: antialiasing not supported in 256 color mode
ru: renderanim: сглаживание не поддерживается в режиме 256 цветов

source: renderanim: incorrect I frame distance
ru: renderanim: неверное расстояние между кадрами

source: animateview: Invalid viewpoint
ru: animateview: Неверная точка зрения

source: Invalid viewpoint
ru: Неверная точка зрения

source: Unknown palette type
ru: Неизвестный тип палитры

source: Initialization of color cycling failed.
ru: Ошибка инициализации цвета зацикливания.

source: Try to enable palette emulation filter
ru: Попробуйте включить фильтр эмуляции палитры

source: Algorithm:%i seed:%i size:%i
ru: Алгоритм:%i зерно:%i размер:%i

source: Root menu
ru: Корневое меню

source: Animation root menu
ru: Корневое меню анимации

source: Replay only commands
ru: Воспроизведение только команд

source: Command line options only
ru: Только параметры командной строки

source: print menus specifications of all menus
ru: печать спецификаций меню всех меню

source: print menu specification
ru: печать спецификации меню

source: print menu specification in xshl format
ru: печать спецификации меню в формате xshl

source: print all menu specifications in xshl format
ru: печать всех спецификаций меню в формате xshl

source: print dialog specification
ru: печать спецификации диалога

source: Line drawing functions
ru: Функции рисования линий

source: Line
ru: Линия

source: Morph line
ru: Морф-линия

source: Morph last line
ru: Последняя морф-линия

source: Set line key
ru: Установить ключ линии

source: Clear line
ru: Очистить линию

source: Clear all lines
ru: Очистить все линии

source: Animation functions
ru: Функции анимации

source: View
ru: Вид

source: Morph view
ru: Морф-вид

source: Morph julia
ru: Морф-Жюлиа

source: Move view
ru: Переместить вид

source: Morph angle
ru: Морф-угол

source: Zoom center
ru: Центр масштабирования

source: Zoom
ru: Масштаб

source: Un-zoom
ru: Снять масштабирование

source: Stop zooming
ru: Остановить масштабирование

source: Smooth morphing parameters
ru: Параметры плавного морфинга

source: Timing functions
ru: Функции тайминга

source: Usleep
ru: Разбудить

source: Wait for text
ru: Ожидание текста

source: Wait for complete image
ru: Ожидание полного изображения

source: Include file
ru: Включить файл

source: Default palette
ru: Палитра по умолчанию

source: Formula
ru: Формула

source: Maximal zooming step
ru: Максимальный шаг масштабирования

source: Zooming speedup
ru: Ускорение масштабирования

source: Filter
ru: Фильтр

source: Letters per second
ru: Букв в секунду

source: Interrupt
ru: Прервать

source: File
ru: Файл

source: Edit
ru: Изменить

source: Fractal
ru: Фрактал

source: Calculation
ru: Калькуляция

source: Filters
ru: Фильтры

source: UI
ru: Интерфейс пользователя

source: Misc
ru: Прочее

source: Window
ru: Окно

source: Tutorials
ru: Учебники

source: Stop replay
ru: Остановить воспроизведение

source: Command
ru: Команда

source: Play string
ru: Воспроизвести строку

source: Render animation
ru: Анимация рендеринга

source: Clear screen
ru: Очистить экран

source: Display fractal
ru: Отобразить фрактал

source: Display text
ru: Показать текст

source: Color
ru: Цвет

source: Horizontal text position
ru: Позиция горизонтального текста

source: Vertical text position
ru: Позиция вертикального текста

source: Text position
ru: Позиция текста

source: Message
ru: Сообщение

source: Load
ru: Загрузить

source: Save
ru: Сохранить

source: Record
ru: Записать

source: Replay
ru: Воспроизведение

source: Save image
ru: Сохранить изображение

source: Load random example
ru: Загрузить случайный пример

source: Save configuration
ru: Сохранить конфигурацию

source: Undo
ru: Вернуть

source: Redo
ru: Повторить

source: Formulae
ru: Формулы

source: More formulae
ru: Больше формул

source: User formula
ru: Пользовательская формула

source: User initialization
ru: Пользовательская инициализация:

source: Incoloring mode
ru: Режим окрашивания внутри

source: Outcoloring mode
ru: Режим окрашивания снаружи

source: Plane
ru: Плоскость

source: Palette
ru: Палитра

source: Mandelbrot mode
ru: Режим Мандельброта

source: Perturbation
ru: Возмущение

source: Reset to defaults
ru: Сбросить на умолчания

source: Julia mode
ru: Режим Жюлиа

source: Set angle
ru: Установить угол

source: Set plane
ru: Установить плоскость

source: Inside coloring mode
ru: Режим окрашивания внутри

source: Outside coloring mode
ru: Режим окрашивания снаружи

source: Inside truecolor coloring mode
ru: Режим окрашивания внутри в истинный цвет

source: Outside truecolor coloring mode
ru: Режим окрашивания снаружи в истинный цвет

source: Julia seed
ru: Зерно Жюлиа

source: Random palette
ru: Случайная палитра

source: Custom palette
ru: Пользовательская палитра

source: Color cycling
ru: Цвет зацикливания

source: Reversed color cycling
ru: Резервный цвет зацикливания

source: Color cycling speed
ru: Цвет скорости зацикливания

source: Shift palette
ru: Сдвиг палитры

source: Shift one forward
ru: Сдвиг вперёд

source: Shift one backward
ru: Сдвиг назад

source: Solid guessing
ru: Угадывание сплошного

source: Dynamic resolution
ru: Динамическое разрешение

source: Periodicity checking
ru: Периодическая проверка

source: Iterations
ru: Итерации

source: Bailout
ru: Спасение

source: Fast julia mode
ru: Быстрый режим Жюлиа

source: Rotation
ru: Поворот

source: Solid guessing range
ru: Диапазон угадывания сплошного

source: Disable rotation
ru: Отключить вращение

source: Continuous rotation
ru: Непрерывное вращение

source: Rotate by mouse
ru: Вращение мышью

source: Rotation speed
ru: Скорость вращения

source: Automatic rotation
ru: Автоматическое вращение

source: Fast rotation mode
ru: Режим быстрого вращения

source: Disable dynamic resolution
ru: Отключить динамическое разрешение

source: Use only during animation
ru: Использовать только при анимации

source: Use also for new images
ru: Использовать также для новых изображений

source: Dynamic resolution mode
ru: Режим динамического разрешения

source: Autopilot
ru: Автопилот

source: VJ mode
ru: Режим VJ

source: Recalculate
ru: Пересчитать

source: Zooming speed
ru: Скорость масштабирования

source: Fixed step
ru: Фиксированный шаг

source: Disable solid guessing
ru: Отключить угадывание сплошного

source: Guess 2x2 rectangles
ru: Угадать 2x2 прямоугольника

source: Guess 3x3 rectangles
ru: Угадать 3x3 прямоугольника

source: Guess 4x4 rectangles
ru: Угадать 4x4 прямоугольника

source: Guess 5x5 rectangles
ru: Угадать 5x5 прямоугольников

source: Guess 6x6 rectangles
ru: Угадать 6x6 прямоугольников

source: Guess 7x7 rectangles
ru: Угадать 7x7 прямоугольников

source: Guess 8x8 rectangles
ru: Угадать 8x8 прямоугольников

source: Guess unlimited rectangles
ru: Угадать безлимитные прямоугольники

source: Language
ru: Язык

source: An introduction to fractals
ru: Введение в фракталы

source: XaoS features overview
ru: Обзор возможностей XaoS

source: Math behind fractals
ru: Математика позади фракталов

source: Other fractal types in XaoS
ru: Другие типы фракталов в XaoS

source: What's new?
ru: Что нового?

source: Whole story
ru: Вся история

source: Introduction
ru: Введение

source: Mandelbrot set
ru: Множество Мандельброта

source: Julia set
ru: Множество Жюлиа

source: Higher power Mandelbrots
ru: Мандельброты высшей силы

source: Newton's method
ru: Метод Ньютона

source: Barnsley's formula
ru: Формула Барнсли

source: Phoenix
ru: Феникс

source: Octo
ru: Окто

source: Magnet
ru: Магнит

source: All features
ru: Все возможности

source: Outcoloring modes
ru: Режимы окрашивания снаружи

source: Incoloring modes
ru: Режимы окрашивания внутри

source: True-color coloring modes
ru: Режимы окрашивания в истинный цвет

source: Planes
ru: Плоскости

source: Animations and position files
ru: Файлы анимаций и позиций

source: Random palettes
ru: Случайные палитры

source: Other noteworthy features
ru: Другие заслуживающие внимания возможности

source: The definition and fractal dimension
ru: Размер определений и фракталов

source: Escape time fractals
ru: Фракталы побега времени

source: Triceratops and Catseye fractals
ru: Фракталы Трицератопс и Кэтси

source: Mandelbar, Lambda, Manowar and Spider
ru: Мандельбар, Лямбда, Мановар и Спайдер

source: Sierpinski Gasket, S.Carpet, Koch Snowflake
ru: Уплотнение Серпинского, Ковёр Серпинского, Снежинка Коха

source: What's new in 3.0?
ru: Что нового в 3.0?

source: line available only in animation replay
ru: линия доступна только в анимационном воспроизведении

source: Morphing non existing line!
ru: Морфинг несуществующей линии!

source: linekey not available in this context!
ru: Ключ линии недоступен в этом контексте!

source: clear_line available only in animation replay
ru: очистить_линию доступно только в анимационном воспроизведении

source: clear_lines available only in animation replay
ru: очистить_линии доступно только в анимационном воспроизведении

source: Catalog file not found
ru: Файл каталога не найден

source: Replay is already active
ru: Воспроизведение уже активно

source: File open failed
ru: Ошибка открытия файла

source: Out of memory
ru: Не хватает памяти

source: Missing parameter
ru: Отсутствует параметр

source: Unexpected end of file
ru: Неожиданный конец файла

source: Token is too long
ru: Токен слишком длинный

source: Unknown formula type
ru: Неизвестный тип формулы

source: morph available only in animation replay
ru: морф доступен только в анимационном воспроизведении

source: morphview: Invalid viewpoint
ru: morphview: Неверная точка зрения

source: move available only in animation replay
ru: перемещение доступно только в анимационном воспроизведении

source: morphjulia available only in animation replay
ru: морф-Жюлиа доступен только в анимационном воспроизведении

source: morphangle available only in animation replay
ru: морф-угол доступен только в анимационном воспроизведении

source: Unknown filter
ru: Неизвестный фильтр

source: sleep available only in animation replay
ru: сон доступен только в анимационном воспроизведении

source: Internal program error #12 %i
ru: Внутренняя ошибка программы #12 %i

source: wait available only in animation replay
ru: ожидание доступно только в анимационном воспроизведении

source: No catalog file loaded
ru: Файл каталога не загружен

source: Message not found in catalog file
ru: Сообщение не найдено в файле каталога

source: load available only in animation replay
ru: загрузка доступна только в анимационном воспроизведении

source: Include level overflow
ru: Включить переполнение уровня

source: File not found
ru: Файл не найден

source: Too many parameters
ru: Слишком много параметров

source: Replay disabled at line %i
ru: Воспроизведение отключено на линии %i

source: Tutorial files not found. Reinstall XaoS
ru: Файлы учебников не найдены. Переустановите XaoS

source: Preparing first image
ru: Подготовка первого изображения

source: Could not open examples
ru: Не удалось открыть примеры

source: File %s loaded.
ru: Файл %s загружен.

source: Saving image...
ru: Сохранение изображения...

source: Save interrupted
ru: Сохранение прервано

source: File %s saved.
ru: Файл %s сохранён.

source: Can not open file
ru: Невозможно открыть файл

source: Recording to file %s enabled.
ru: Запись в файл %s включена.

source: Solid guessing 1
ru: Угадывание сплошного 1

source: Boundary trace
ru: След границы

source: Cancel
ru: Отменить

source: Error: %s
ru: Ошибка: %s

source: Cannot open motion vector file!
ru: Невозможно открыть файл вектора движения!

source: Vectors: %i
ru: Векторы: %i

source: Initializing
ru: Инициализация

source: Cannot create palette
ru: Невозможно создать палитру

source: Cannot create image
ru: Невозможно создать изображение

source: Cannot create checking buffer!
ru: Невозможно создать контрольный буфер!

source: Cannot create context
ru: Невозможно создать контекст

source: Cannot open animation file
ru: Невозможно открыть файл анимации

source: Loading catalogs
ru: Загрузка каталогов

source: Processing command line options
ru: Обработка параметров командной строки

source: Enabling animation replay
ru: Включение анимационного воспроизведения

source: Cannot open image file
ru: Невозможно открыть файл изображения

source: Cannot open pattern file
ru: Невозможно открыть файл узора

source: Entering calculation loop!
ru: Вход в цикл расчёта!

source: Frame %i skipped.
ru: Кадр %i пропущен.

source: Frames %i - %i skipped.
ru: Кадры %i - %i пропущены.

source: Frame %4i:
ru: Кадр %4i:

source: done.
ru: готово.

source: skipping...
ru: пропускание...

source: Calculation interrupted
ru: Расчёт прерван

source: Calculation finished
ru: Расчёт закончен

source: Copy
ru: Копировать

source: Paste
ru: Вставить

source: About
ru: О программе

source: About XaoS
ru: О программе XaoS

source: Services
ru: Сервисы

source: Hide XaoS
ru: Скрыть XaoS

source: Hide Others
ru: Скрыть прочее

source: Show All
ru: Показать все

source: Quit XaoS
ru: Выйти из XaoS

source: Cut
ru: Вырезать

source: Delete
ru: Удалить

source: Select All
ru: Выбрать все

source: Minimize
ru: Минимизировать

source: Bring All to Front
ru: Переместить все на передний план

source: Close
ru: Закрыть

source: Videator Output
ru: Вывод Videator

source: Choose
ru: Выбрать
